## Q1. List any five functions of the pandas library with execution.

In [ ]:
Pandas Functions for Data Analysis and Manipulation
1.read()
2.head()
3. shape
4. info ()
6. isnull ()
7. drop ()
8. describe ()
9. value_counts ()

In [18]:
import pandas as pd
#reading the file

df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
#getting first and last five records
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
#getting information of database wrt columns and data structure and some additional infoemation
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
#database rows and column structire.
df.shape

(891, 12)

In [11]:
##getting total of number of columns are having null value
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
#df[df['Age'].isnull()]

In [15]:
#Describing or getting explaination of statastical columns wrt to ..some statastical terms
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [22]:
#getting the rows and columns wrt index/value/number wise.
df.iloc[0:5,[2,3]]

   Pclass                                               Name
0       3                            Braund, Mr. Owen Harris
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       3                             Heikkinen, Miss. Laina
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       3                           Allen, Mr. William Henry

In [24]:
#getiing the rows and columns wrt column name wise
df.loc[0:5,['Survived','Pclass']]

   Survived  Pclass
0         0       3
1         1       1
2         1       3
3         1       1
4         0       3
5         0       3

In [28]:
#getting number of sum of categorical values of the perticular column
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [32]:
#dropping the column
df.drop('SibSp',axis=1,inplace=True)

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [1]:
import pandas as pd

In [46]:
lst=[['a1','b1','c1'],['a2','b2','c2'],['a3','b3','c3']]

In [48]:
df=pd.DataFrame(lst,columns=['a','b','c'])

In [49]:
df

    a   b   c
0  a1  b1  c1
1  a2  b2  c2
2  a3  b3  c3

In [50]:
df=pd.DataFrame(lst,index=[1,2,3],columns=['a','b','c'])

In [51]:
df

    a   b   c
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [57]:
lst=[['a1',10],['a2',20],['a3',30],['a4',40],['a5',50]]

In [58]:
df=pd.DataFrame(lst,columns=['a','Values'])

In [59]:
df

    a  Values
0  a1      10
1  a2      20
2  a3      30
3  a4      40
4  a5      50

In [64]:
df['Values'][0:3].sum()

60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [65]:
lst = [['Ram Rao',10],['Radhika',20],['Rekha D Rao',30]]

In [67]:
df =  pd.DataFrame(lst,columns = ['Text','Score'] )

In [68]:
df

          Text  Score
0      Ram Rao     10
1      Radhika     20
2  Rekha D Rao     30

In [73]:
#lambda x: len(str(x).split(' ')
df['Word_count'] = df['Text'].str.split(' ').apply(len)

In [74]:
df

          Text  Score  Word_count
0      Ram Rao     10           2
1      Radhika     20           1
2  Rekha D Rao     30           3

## Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
lst = [['Ram Rao',10],['Radhika',20],['Rekha D Rao',30]]

In [83]:
df =  pd.DataFrame(lst,columns = ['Text','Score'] )

In [84]:
df

          Text  Score
0      Ram Rao     10
1      Radhika     20
2  Rekha D Rao     30

In [81]:
#it is defining the sum of number of rows and columns
#size is shape[0] multiply shape[1] means rows*columns
df.size

6

In [82]:
##Shape is defining number of rows and columns in the dataset
df.shape

(3, 2)

## 6. Which function of pandas do we use to read an excel file?

In [ ]:
function read_excel() is used for reading the excel files in Dataframe

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [6]:
dict1={'Email' : ["john.doe@example.com","sadh@gmail.com","p_j@yahoo.com"]}
dict1

{'Email': ['john.doe@example.com', 'sadh@gmail.com', 'p_j@yahoo.com']}

In [16]:
#df1['Email'].str.split("@")
#df1['Email'].str.split("@").str[0]

0    john.doe
1        sadh
2         p_j
Name: Email, dtype: object

In [19]:
def user_ex(df1):
    df1['Username']= df1['Email'].str.split("@").str[0]
    return df1

In [20]:
user_ex(df1)

                  Email  Username
0  john.doe@example.com  john.doe
1        sadh@gmail.com      sadh
2         p_j@yahoo.com       p_j

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

In [62]:
df=pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})

In [63]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [64]:
df[(df['A']>5 )& (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [82]:
def new_fun(df):
    return df[(df['A']>5 )& (df['B']<10)]

In [83]:
new_fun(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2